In [1]:
import numpy as np 
import pandas as pd 
from pandas import Series,DataFrame

In [2]:
dframe1 = DataFrame(np.arange(8).reshape(2,4),index=pd.Index(['LA','SF'],name='city'),columns=pd.Index(['A','B','C','D'],name='letter'))

In [3]:
dframe1

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [4]:
dframe_st=dframe1.stack()

In [5]:
dframe_st

city  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int64

In [7]:
dframe_st.unstack()

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [8]:
dframe_st.unstack('city')

city    LA  SF
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [9]:
ser1=Series([0,1,2],index=['q','x','y'])
ser2=Series([4,5,6],index=['x','y','z'])

In [10]:
dframe=pd.concat([ser1,ser2],keys=['alpha','vita'])

In [11]:
dframe

alpha  q    0
       x    1
       y    2
vita   x    4
       y    5
       z    6
dtype: int64

In [12]:
dframe.unstack()

         q    x    y    z
alpha  0.0  1.0  2.0  NaN
vita   NaN  4.0  5.0  6.0

In [13]:
dframe.unstack().stack()

alpha  q    0.0
       x    1.0
       y    2.0
vita   x    4.0
       y    5.0
       z    6.0
dtype: float64

In [14]:
dframe = dframe.unstack()

In [15]:
dframe

         q    x    y    z
alpha  0.0  1.0  2.0  NaN
vita   NaN  4.0  5.0  6.0

In [16]:
dframe.stack(dropna=False)

alpha  q    0.0
       x    1.0
       y    2.0
       z    NaN
vita   q    NaN
       x    4.0
       y    5.0
       z    6.0
dtype: float64